zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52810.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>POWER</name>
      <description>Power control</description>
      <groupName>POWER</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <alternatePeripheral>BPROT</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>POWER_CLOCK</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_CONSTLAT</name>
          <description>Enable constant latency mode</description>
          <addressOffset>0x078</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CONSTLAT</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_LOWPWR</name>
          <description>Enable low power mode (variable latency)</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_LOWPWR</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_POFWARN</name>
          <description>Power failure warning</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_POFWARN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SLEEPENTER</name>
          <description>CPU entered WFI/WFE sleep</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SLEEPENTER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SLEEPEXIT</name>
          <description>CPU exited WFI/WFE sleep</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SLEEPEXIT</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POFWARN</name>
              <description>Write '1' to Enable interrupt for POFWARN event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPENTER</name>
              <description>Write '1' to Enable interrupt for SLEEPENTER event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPEXIT</name>
              <description>Write '1' to Enable interrupt for SLEEPEXIT event</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POFWARN</name>
              <description>Write '1' to Disable interrupt for POFWARN event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPENTER</name>
              <description>Write '1' to Disable interrupt for SLEEPENTER event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPEXIT</name>
              <description>Write '1' to Disable interrupt for SLEEPEXIT event</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETREAS</name>
          <description>Reset reason</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESETPIN</name>
              <description>Reset from pin-reset detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOG</name>
              <description>Reset from watchdog detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREQ</name>
              <description>Reset from soft reset detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>Reset from CPU lock-up detected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power failure comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power failure comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power failure comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V17</name>
                  <description>Set threshold to 1.7 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V18</name>
                  <description>Set threshold to 1.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPREGRET</name>
          <description>General purpose retention register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPREGRET</name>
              <description>General purpose retention register</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GPREGRET2</name>
          <description>General purpose retention register</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPREGRET</name>
              <description>General purpose retention register</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCEN</name>
          <description>DC/DC enable register</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable or disable DC/DC converter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <name>RAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>POWER_RAM</headerStructName>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster[0]:  RAM0 power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 ON or OFF in System ON mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 ON or OFF in System ON mode.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 when RAM section is in OFF</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 when RAM section is in OFF</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
