zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52810.svd
        <register>
          <name>LATCH</name>
          <description>Latch register indicating what GPIO pins that have met the criteria set in the PIN_CNF[n].SENSE registers</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN0</name>
              <description>Status on whether PIN0 has met criteria set in PIN_CNF0.SENSE register. Write '1' to clear.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN1</name>
              <description>Status on whether PIN1 has met criteria set in PIN_CNF1.SENSE register. Write '1' to clear.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN2</name>
              <description>Status on whether PIN2 has met criteria set in PIN_CNF2.SENSE register. Write '1' to clear.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN3</name>
              <description>Status on whether PIN3 has met criteria set in PIN_CNF3.SENSE register. Write '1' to clear.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN4</name>
              <description>Status on whether PIN4 has met criteria set in PIN_CNF4.SENSE register. Write '1' to clear.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN5</name>
              <description>Status on whether PIN5 has met criteria set in PIN_CNF5.SENSE register. Write '1' to clear.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN6</name>
              <description>Status on whether PIN6 has met criteria set in PIN_CNF6.SENSE register. Write '1' to clear.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN7</name>
              <description>Status on whether PIN7 has met criteria set in PIN_CNF7.SENSE register. Write '1' to clear.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN8</name>
              <description>Status on whether PIN8 has met criteria set in PIN_CNF8.SENSE register. Write '1' to clear.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN9</name>
              <description>Status on whether PIN9 has met criteria set in PIN_CNF9.SENSE register. Write '1' to clear.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN10</name>
              <description>Status on whether PIN10 has met criteria set in PIN_CNF10.SENSE register. Write '1' to clear.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN11</name>
              <description>Status on whether PIN11 has met criteria set in PIN_CNF11.SENSE register. Write '1' to clear.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN12</name>
              <description>Status on whether PIN12 has met criteria set in PIN_CNF12.SENSE register. Write '1' to clear.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN13</name>
              <description>Status on whether PIN13 has met criteria set in PIN_CNF13.SENSE register. Write '1' to clear.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN14</name>
              <description>Status on whether PIN14 has met criteria set in PIN_CNF14.SENSE register. Write '1' to clear.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN15</name>
              <description>Status on whether PIN15 has met criteria set in PIN_CNF15.SENSE register. Write '1' to clear.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN16</name>
              <description>Status on whether PIN16 has met criteria set in PIN_CNF16.SENSE register. Write '1' to clear.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN17</name>
              <description>Status on whether PIN17 has met criteria set in PIN_CNF17.SENSE register. Write '1' to clear.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN18</name>
              <description>Status on whether PIN18 has met criteria set in PIN_CNF18.SENSE register. Write '1' to clear.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN19</name>
              <description>Status on whether PIN19 has met criteria set in PIN_CNF19.SENSE register. Write '1' to clear.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN20</name>
              <description>Status on whether PIN20 has met criteria set in PIN_CNF20.SENSE register. Write '1' to clear.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN21</name>
              <description>Status on whether PIN21 has met criteria set in PIN_CNF21.SENSE register. Write '1' to clear.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN22</name>
              <description>Status on whether PIN22 has met criteria set in PIN_CNF22.SENSE register. Write '1' to clear.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN23</name>
              <description>Status on whether PIN23 has met criteria set in PIN_CNF23.SENSE register. Write '1' to clear.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN24</name>
              <description>Status on whether PIN24 has met criteria set in PIN_CNF24.SENSE register. Write '1' to clear.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN25</name>
              <description>Status on whether PIN25 has met criteria set in PIN_CNF25.SENSE register. Write '1' to clear.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Status on whether PIN26 has met criteria set in PIN_CNF26.SENSE register. Write '1' to clear.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Status on whether PIN27 has met criteria set in PIN_CNF27.SENSE register. Write '1' to clear.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Status on whether PIN28 has met criteria set in PIN_CNF28.SENSE register. Write '1' to clear.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Status on whether PIN29 has met criteria set in PIN_CNF29.SENSE register. Write '1' to clear.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN30</name>
              <description>Status on whether PIN30 has met criteria set in PIN_CNF30.SENSE register. Write '1' to clear.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Status on whether PIN31 has met criteria set in PIN_CNF31.SENSE register. Write '1' to clear.</description>
              <lsb>31</lsb>
